<div id="masthead_nh">
  <p>&nbsp;</p>
  <h2>Подтверждение действия</h2>
  <p>&nbsp;</p>
  <p>В этом примере демонстрируется защита действий на сайте через требование их подтверждения подписанием соответствующего документа.</p>
  <p>&nbsp;</p>
  <p>
    Общий порядок работы такого подтверждения следующий:<br>
    1. Пользователь с помощью процедуры регистрации привязывает свой публичный ключ к логину на сайте.<br>
    2. В случае возникновения ситуации, которая требует подтверждения, пользователю выдается QR-код со ссылкой на документ для подписания, 
    факт подписания которого и является дополнительным подтверждением для данного действия.
  </p>
  <p>&nbsp;</p>
  <p>
    В нашем примере лишь одно упрощение - привязка происходит не к логину, а к одноразовому коду, который на реальном сайте как раз и будет 
    использоваться для привязки подписи к логину пользователя.
  </p>
  <p>&nbsp;</p>
</div>
<div id="blue-bar">
	&nbsp;
</div>
<div id="main">
  <div id="content">
    <table width="100%">
      <tr>
        <td align="left">
          <a href="/" class="green-button-plain">&lt;&lt; Назад</a>
        </td>
        <td align="right">
          <a href="/confirm_sample/register" class="green-button-plain">Регистрация &gt;&gt;</a>
        </td>
      </tr>
    </table>
  </div>
</div>
