			<div id="masthead">
				<h2>ПРОСТОТА И УДОБСТВО!</h2>
				<p id="intro">Небольшое приложение для больших изменений.</p>
				<img src="/images/app-qr-code.gif" style="padding-bottom: 16px;" />
				<a href="https://play.google.com/store/apps/details?id=org.gplvote.signdoc" class="green-button">Установка</a>
				<img src="/images/phones.png" alt="Phones" id="phones" />
				<div id="ribbon"><br>Открытое ПО</div>
				<p>&nbsp;</p>
			</div>
			<div id="blue-bar">
				&nbsp;
			</div>
			<div id="main">
				<div id="content">
                                        <p>ВНИМАНИЕ!!! Если у вас установлено приложение версии ниже 1.14, тесты не будут работать как положено. В этом случае просим вас обновить мобильное приложение.</p>
                                        <p>&nbsp;</p>
                                        <table width="100%" class="examples">
                                        <tr>
                                          <td width="33%">
                                            <a href="/petition_sample" class="block_info_link">
                                              <div class="block_info">
                                                <h3>Петиция</h3>
                                                <br>
                                                <p>Позволяет подписывать публичные петиции без предварительной регистрации на сайте.</p>
                                              </div>
                                            </a>
                                          </td>
                                          <td width="33%">
                                            <a href="/vote_sample" class="block_info_link">
                                              <div class="block_info">
                                                <h3>Голосование</h3>
                                                <br>
                                                <p>Позволяет участвовать в голосованиях без предварительной регистрации на сайте.</p>
                                              </div>
                                            </a>
                                          </td>
                                          <td width="33%">
                                            <a href="/confirm_sample" class="block_info_link">
                                              <div class="block_info">
                                                <h3>Подтверждение действий</h3>
                                                <br>
                                                <p>Позволяет подтверждать свои действия на сайте.</p>
                                              </div>
                                            </a>
                                          </td>
                                        </tr>
                                        </table>
                                        
					<h2>Общее описание</h2>

					<p align="justify">
					Приложение GPLVote Sign Doc дает возможность пользователю простым образом использовать свою криптографическую цифровую 
					подпись для подписания различных документов. Документы для подписания могут создаваться различными сайтами и использоваться 
					для различных целей: для подтверждения действий пользователя на сайте (например, смены пароля), для подписания различных 
					петиций или для участия в голосованиях.
					</p>
					<p>&nbsp;</p>
					<p align="justify">Использование такой подписи делает невозможной подделку подписанных данных пользователя. Что очень важно для действий, 
					влекущих за собой существенные последствия. Например, несанкционированное изменение пароля пользователя на сайте может привести 
					к потере доступа к этому сайту. Это не существенно для новостного сайта. Но если это сайт интернет магазина или платежной системы? 
					Тогда речь может идти о вполне реальной денежной потере.</p>
					<p>&nbsp;</p>
					<h3>Особенности нашего приложения</h3>
					<p>&nbsp;</p>
					<p align="justify">Суть предлагаемого решения заключается в использовании специального мобильного приложения. В нем формируются ключи
					шифрования, которые в последующем используются для подписания документов. Особенности этого процесса в том, что в нем 
					участвует два ключа - открытый, доступный всем, и закрытый, который храниться в тайне в данном приложении. По открытому 
					ключу вас будут идентифицировать на сайтах и других системах. И с его-же помощью будут проверять вашу подпись на документах. 
					С помощью закрытытого ключа в приложении вы можете подписывать документы.</p>
					<p>&nbsp;</p>
					<p align="justify">И самое важное заключается в том, что с помощью открытого ключа можно только проверить вашу подпись. А создать ее можно 
					исключительно с помощью закрытого ключа, доступ к которому имеете только вы. Сила этой защиты строиться на математике
					простых чисел. На современном уровне развития компьютерной техники эти методы подписания документов являются практически
					полностью надежными. А открытость исходных кодов приложения позволяет гарантировать отсутствие в нем других лазеек.</p>
					<p>&nbsp;</p>
				</div>
			</div>
